Revit 2027 API
Document.NewArea Method
Creates a new area
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Area NewArea(
	ViewPlan areaView,
	UV point
)
Public Function NewArea (
	areaView As ViewPlan,
	point As UV
) As Area
public:
Area^ NewArea(
	ViewPlan^ areaView,
	UV^ point
)
member NewArea :
        areaView : ViewPlan *
        point : UV -> Area
Parameters
areaView ViewPlan
The view of area element.
point UV
The point which lies in the enclosed region of AreaBoundaryLines to put the new created Area
Return Value
Area
Exceptions
Exception | Condition
ArgumentException | Thrown if the area view does not exist in the given document.
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace